<?php
$arr = [
    'Московская область:' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область:' => ['Санкт-Петербург', 'Ксеволожск', 'Кавловск', 'Кронштадт'],
    'Рязанская область:' => ['Рязань', 'Михайлов', 'Скопин', 'Сасово', 'Ряжск'],
    'Ставропольский край:' => ['Ставрополь', 'Ессентуки', 'Кисловодск', 'Невинномысск', 'Буденновск']
];
foreach ($arr as $region => $cities) {
	echo $region . '<br>';
	$city_display = [];
	foreach ($cities as $city) {
		if (mb_substr($city, 0, 1) == 'К') {
			$city_display[] = $city;
		}
	}
	if (empty($city_display)){
		echo 'Пусто';
	}
	echo implode(', ', $city_display) . '<br><br>';
}
?>